{"version":"1","records":[{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos"},"type":"lvl1","url":"/bloque1","position":0},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos"},"content":"","type":"content","url":"/bloque1","position":1},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"1. ¿Qué es Google Sheets?"},"type":"lvl2","url":"/bloque1#id-1-qu-es-google-sheets","position":2},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"1. ¿Qué es Google Sheets?"},"content":"Google Sheets\n\nGoogle Sheets (Hojas de Cálculo) es una aplicación de hoja de cálculo gratuita y basada en la web, provista por Google dentro del servicio Google Drive.\n\nPermite a los usuarios organizar, editar, analizar diferentes tipos de información, y es clave para el trabajo colaborativo, ya que múltiples usuarios pueden editar y dar formato a los archivos en tiempo real.\n\nUna hoja de cálculo es el documento completo (o Spreadsheet) que contiene conjuntos de columnas y filas. Dentro de un documento, puede haber una o más Worksheets (hojas), que son conjuntos nombrados de filas y columnas.","type":"content","url":"/bloque1#id-1-qu-es-google-sheets","position":3},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"2. Vocabulario Estructural"},"type":"lvl2","url":"/bloque1#id-2-vocabulario-estructural","position":4},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"2. Vocabulario Estructural"},"content":"Para trabajar en Google Sheets, es esencial conocer los nombres de sus componentes principales, que forman una matriz o cuadrícula:\n\nConcepto\n\nDefinición\n\nEjemplos (Basados en las Tareas)\n\nCitas de Origen\n\nCelda (Cell)\n\nEs la unidad mínima y fundamental de información, o un solo punto de dato. Se identifica por la intersección de una columna y una fila.\n\nB4, A9, E12, D5, F18.\n\n\n\nColumna (Column)\n\nEs la disposición vertical de celdas, identificada por letras (A, B, C...).\n\nColorear la columna C de color verde.\n\n\n\nFila (Row)\n\nEs la disposición horizontal de celdas, identificada por números (1, 2, 3...).\n\nColorear la fila 8 de color gris.\n\n\n\nRango (Range)\n\nEs un conjunto rectangular de múltiples celdas adyacentes. Se define por las referencias de las celdas de las esquinas, separadas por dos puntos.\n\nE3:G7 (rango de celdas coloreado de rosa).\n\n\n\n\n\nFigure 1:Fundamentos de Google Sheets.","type":"content","url":"/bloque1#id-2-vocabulario-estructural","position":5},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"3. Entrada y Manipulación de Datos"},"type":"lvl2","url":"/bloque1#id-3-entrada-y-manipulaci-n-de-datos","position":6},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"3. Entrada y Manipulación de Datos"},"content":"La forma en que se introducen y mueven los datos afecta la eficiencia del trabajo:\n\nEntrada Básica: Para añadir datos a una celda, simplemente se hace clic en ella y se escribe. Para facilitar la manipulación o el filtrado posterior, es una buena práctica que cada celda contenga solo un valor.\n\nNavegación: Después de escribir en una celda, se puede presionar la tecla Enter o return para guardar el dato y mover el cursor al inicio de la siguiente fila. Alternativamente, se puede presionar Tab para guardar el dato y moverse una celda a la derecha dentro de la misma fila.\n\nEl Puntero de Relleno (Fill Handle): Es un pequeño signo de más (+) que aparece en la esquina inferior derecha de una celda seleccionada. Al arrastrar este puntero, se pueden copiar automáticamente datos, formatos o fórmulas a celdas adyacentes.","type":"content","url":"/bloque1#id-3-entrada-y-manipulaci-n-de-datos","position":7},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"4. Formatos de Celda"},"type":"lvl2","url":"/bloque1#id-4-formatos-de-celda","position":8},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"4. Formatos de Celda"},"content":"El formato manual permite modificar directamente la apariencia de los datos, mejorando la presentación y la legibilidad.","type":"content","url":"/bloque1#id-4-formatos-de-celda","position":9},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"A. Formato de Contenido: Texto y Números","lvl2":"4. Formatos de Celda"},"type":"lvl3","url":"/bloque1#a-formato-de-contenido-texto-y-n-meros","position":10},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"A. Formato de Contenido: Texto y Números","lvl2":"4. Formatos de Celda"},"content":"Formato\n\nUso Práctico\n\nEjemplos de Contenido\n\nCitas de Origen\n\nEstilo de Fuente\n\nDestacar información importante. Se utilizan: Negrita, Subrayado y Cursiva.\n\nEscribir 6798 en negrita. Escribir “Fotografía” subrayada en B10. Escribir el número 56 en cursiva de color rojo.\n\n\n\nAlineación\n\nDeterminar la posición del contenido dentro de la celda.\n\nCentrar la palabra “Internet” en la celda F18.\n\n","type":"content","url":"/bloque1#a-formato-de-contenido-texto-y-n-meros","position":11},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"B. Formato de Estructura","lvl2":"4. Formatos de Celda"},"type":"lvl3","url":"/bloque1#b-formato-de-estructura","position":12},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"B. Formato de Estructura","lvl2":"4. Formatos de Celda"},"content":"Estos formatos se aplican a las celdas o rangos para organizar visualmente la hoja:\n\nRelleno o Color de Fondo: Permite colorear el fondo para agrupar o destacar visualmente los datos. Por ejemplo, se pide colorear la celda B4 de color rojo, la fila 8 de gris, o el rango E3:G7 de rosa.\n\nBordes (Borders): Se usan para dibujar límites y delimitar secciones. Hay diferentes grosores, como el borde grueso (ej. celda E9 o J15) o el borde fino (ej. celda B10).","type":"content","url":"/bloque1#b-formato-de-estructura","position":13},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"C. Formatos Numéricos Especializados","lvl2":"4. Formatos de Celda"},"type":"lvl3","url":"/bloque1#c-formatos-num-ricos-especializados","position":14},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl3":"C. Formatos Numéricos Especializados","lvl2":"4. Formatos de Celda"},"content":"Para el análisis correcto de los datos, es crucial aplicar el formato numérico que corresponda al tipo de información:\n\nFormato Decimal: Se usa para especificar la cantidad de cifras después de la coma. Por ejemplo, en operaciones matemáticas, se puede requerir que el resultado muestre dos decimales, únicamente (ej. 130,67).\n\nFormato Moneda o Contabilidad: Añade el símbolo de la moneda (ej. €) a los valores.\n\nFormato Porcentaje: Se usa para expresar valores como una fracción de 100 (ej. 21,00% para la tasa de IVA).","type":"content","url":"/bloque1#c-formatos-num-ricos-especializados","position":15},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"5. Diferencia Clave: Formato Manual vs. Formato Condicional"},"type":"lvl2","url":"/bloque1#id-5-diferencia-clave-formato-manual-vs-formato-condicional","position":16},{"hierarchy":{"lvl1":"I. Estructura y Formatos Básicos","lvl2":"5. Diferencia Clave: Formato Manual vs. Formato Condicional"},"content":"Es importante distinguir entre el formato que aplica manualmente en este bloque (ej. colorear una celda de rojo) y el formato avanzado que se aprenderá más adelante:\n\nFormato Manual: El estilo se aplica de forma directa y es estático; no cambia si el valor de la celda cambia.\n\nFormato Condicional: El formato (por ejemplo, el color) se aplica automáticamente solo si el valor de la celda cumple una condición lógica o regla predefinida. Por ejemplo, se utiliza el formato condicional para que las notas iguales o superiores a 5 se muestren en verde, mientras que las inferiores a 5 se muestren en rojo. Este es un ejemplo de lógica automática.\n\nSímil:\n\nImagine Google Sheets como un archivador digital:\n\nLa Celda es la ficha individual donde se escribe un dato.\n\nLa Fila es una caja horizontal que contiene todas las fichas de un mismo objeto (por ejemplo, los datos de un alumno).\n\nLa Columna es una caja vertical que contiene el mismo tipo de dato para todos los objetos (por ejemplo, todas las notas de Matemáticas).\n\nEl Formato es la etiqueta de color o el tipo de letra que se usa para que la información sea fácil de encontrar y entender.","type":"content","url":"/bloque1#id-5-diferencia-clave-formato-manual-vs-formato-condicional","position":17},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación"},"type":"lvl1","url":"/bloque2","position":0},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación"},"content":"Este bloque se centran en la habilidad esencial de la hoja de cálculo: el procesamiento de datos. Los alumnos aprenderán a utilizar expresiones matemáticas básicas (fórmulas) y funciones predefinidas para resumir y calcular información.","type":"content","url":"/bloque2","position":1},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl2":"1. Fórmulas: La Base de los Cálculos"},"type":"lvl2","url":"/bloque2#id-1-f-rmulas-la-base-de-los-c-lculos","position":2},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl2":"1. Fórmulas: La Base de los Cálculos"},"content":"Una Fórmula es una expresión completa construida por el usuario que combina funciones, referencias de celdas, filas, columnas y rangos para alcanzar un resultado específico.","type":"content","url":"/bloque2#id-1-f-rmulas-la-base-de-los-c-lculos","position":3},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"I. Sintaxis y Operadores Aritméticos","lvl2":"1. Fórmulas: La Base de los Cálculos"},"type":"lvl3","url":"/bloque2#i-sintaxis-y-operadores-aritm-ticos","position":4},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"I. Sintaxis y Operadores Aritméticos","lvl2":"1. Fórmulas: La Base de los Cálculos"},"content":"Toda fórmula en Google Sheets debe comenzar obligatoriamente con el signo de igual (=).\n\nOperación\n\nSímbolo (Operador)\n\nUso\n\nCita de Origen\n\nSuma\n\n+\n\nPara la adición.\n\n\n\nResta\n\n-\n\nPara la sustracción.\n\n\n\nMultiplicación\n\n*\n\nPara multiplicar cifras.\n\n\n\nDivisión\n\n/\n\nPara dividir cifras.\n\n\n\nExponente\n\n^\n\nPara elevar un número a una potencia.\n\n\n\nFórmulas Compuestas y Jerarquía:\nSe pueden realizar operaciones complejas combinando varios operadores y referencias a celdas. Google Sheets utiliza el orden de operaciones PEMDAS (Paréntesis, Exponentes, Multiplicación, División, Adición, Sustracción) para determinar la secuencia correcta de los cálculos.\n\nEjemplo de operaciones complejas:\n\n“Restar las dos primeras cifras y, el resultado, multiplicarlo por la tercera cifra”.\n\n“Multiplicar las dos primeras cifras y, el resultado, dividirlo por la tercera cifra”.","type":"content","url":"/bloque2#i-sintaxis-y-operadores-aritm-ticos","position":5},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"II. Formato Numérico en los Cálculos","lvl2":"1. Fórmulas: La Base de los Cálculos"},"type":"lvl3","url":"/bloque2#ii-formato-num-rico-en-los-c-lculos","position":6},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"II. Formato Numérico en los Cálculos","lvl2":"1. Fórmulas: La Base de los Cálculos"},"content":"Cuando se realizan cálculos (como la división), es importante aplicar formatos para la correcta visualización de los datos:\n\nFormato Decimal: Permite limitar el resultado a un número específico de cifras después de la coma. Por ejemplo, un resultado puede mostrarse con dos decimales, únicamente (ej. 130,67).\n\nFormato Moneda: Se utiliza para indicar que un valor representa dinero, añadiendo el símbolo de la moneda (ej. € en la tabla de dinero ahorrado mensual).\n\n\n\nFigure 1:Fórmulas y funciones de Google Sheets.","type":"content","url":"/bloque2#ii-formato-num-rico-en-los-c-lculos","position":7},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl2":"2. Funciones: Automatización de Cálculos"},"type":"lvl2","url":"/bloque2#id-2-funciones-automatizaci-n-de-c-lculos","position":8},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl2":"2. Funciones: Automatización de Cálculos"},"content":"Una Función es una fórmula prediseñada que está incorporada en la aplicación, la cual se utiliza para calcular valores y manipular datos. Las funciones simplifican procesos estándar al automatizar los cálculos.\n\nEl uso de funciones básicas es el método más simple para comenzar a agregar o resumir grandes cantidades de datos.","type":"content","url":"/bloque2#id-2-funciones-automatizaci-n-de-c-lculos","position":9},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"I. Funciones de Agregación Fundamentales","lvl2":"2. Funciones: Automatización de Cálculos"},"type":"lvl3","url":"/bloque2#i-funciones-de-agregaci-n-fundamentales","position":10},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"I. Funciones de Agregación Fundamentales","lvl2":"2. Funciones: Automatización de Cálculos"},"content":"Estas funciones son esenciales para obtener resúmenes rápidos de un conjunto de datos. Se aplican sobre un rango de celdas.\n\nFunción\n\nUso y Propósito\n\nEjemplo de Aplicación (Basado en las Fuentes)\n\nCitas de Origen\n\nSUMA (=SUMA(rango))\n\nSuma todos los números en un rango de celdas.\n\nCalcular el TOTAL de dinero ahorrado por Juan, o el TOTAL de trabajadores por empresa o por año.\n\n\n\nPROMEDIO (=PROMEDIO(rango))\n\nCalcula el valor medio (media aritmética) de los números en un rango.\n\nCalcular la MEDIA de dinero ahorrado por una persona.\n\n\n\nMÁXIMO (=MAX(rango))\n\nEncuentra el valor más alto o máximo en un rango.\n\nCalcular el ahorro MÁXIMO de un mes para una persona.\n\n\n\nMÍNIMO (=MIN(rango))\n\nEncuentra el valor más bajo o mínimo en un rango.\n\nCalcular el ahorro MÍNIMO de un mes para una persona.\n\n\n\nCONTAR (=COUNT(rango))\n\nCuenta cuántas celdas en un rango contienen números.\n\nSe utiliza para determinar, por ejemplo, el número de alumnos aprobados y suspensos. (Se puede usar COUNTA para contar todas las celdas que no están vacías, incluyendo texto).\n\n","type":"content","url":"/bloque2#i-funciones-de-agregaci-n-fundamentales","position":11},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"II. Eficiencia: El Puntero de Relleno","lvl2":"2. Funciones: Automatización de Cálculos"},"type":"lvl3","url":"/bloque2#ii-eficiencia-el-puntero-de-relleno","position":12},{"hierarchy":{"lvl1":"II. Fórmulas y Funciones de Agregación","lvl3":"II. Eficiencia: El Puntero de Relleno","lvl2":"2. Funciones: Automatización de Cálculos"},"content":"El Puntero de Relleno (Fill Handle) es una herramienta fundamental para copiar fórmulas sin tener que reescribirlas manualmente.\n\n¿Cómo se ve? Es un pequeño signo de más (+) que aparece en la esquina inferior derecha de una celda o rango seleccionado.\n\n¿Para qué sirve? Al arrastrar el puntero de relleno, se puede copiar la fórmula a las celdas vecinas.\n\nListas Ordenadas: Si se seleccionan al menos dos celdas que contienen una secuencia numérica (ej. 1, 2), al arrastrar el puntero de relleno, Google Sheets automáticamente continuará la secuencia (ej. 3, 4, 5...). Si se selecciona una serie de celdas con números arbitrarios, Google Sheets repetirá el patrón.\n\nAnalogía para la Diferencia entre Fórmula y Función:\n\nUna Función (como SUMA) es como un electrodoméstico ya construido, por ejemplo, una batidora. Está lista para usarse. Una Fórmula es la receta completa (el signo =) que utiliza ese electrodoméstico junto con otros ingredientes (referencias de celda y operadores) para obtener el resultado final (el plato terminado). En este bloque, aprendemos a hacer las “recetas” más sencillas.","type":"content","url":"/bloque2#ii-eficiencia-el-puntero-de-relleno","position":13},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas"},"type":"lvl1","url":"/bloque3","position":0},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas"},"content":"Este bloque te enseña a crear hojas de cálculo inteligentes que pueden tomar decisiones basadas en los datos (Lógica Condicional) y cómo asegurar que tus fórmulas funcionen correctamente cuando las copias (Referencias).","type":"content","url":"/bloque3","position":1},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"type":"lvl2","url":"/bloque3#id-1-referencias-qu-fijo-y-qu-muevo","position":2},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"content":"Cuando trabajamos con fórmulas, es vital entender cómo se comportan las referencias de celda cuando copiamos esa fórmula a otras celdas.","type":"content","url":"/bloque3#id-1-referencias-qu-fijo-y-qu-muevo","position":3},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. Referencia Relativa (Automática)","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"type":"lvl3","url":"/bloque3#i-referencia-relativa-autom-tica","position":4},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. Referencia Relativa (Automática)","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"content":"La Referencia Relativa es la forma en que Google Sheets trabaja por defecto.\n\nDefinición: Cuando copias una fórmula a una celda vecina, las referencias a las filas y columnas se ajustan automáticamente para mantener la misma posición relativa.\n\nUso Práctico: Se utiliza cuando quieres aplicar la misma operación a datos diferentes en cada fila.\n\nEjemplo: Para calcular la Media de las notas de los exámenes de varios estudiantes, la fórmula en la celda D2 es =PROMEDIO(B2:C2). Si arrastras esta fórmula hacia abajo a D3, automáticamente cambia a =PROMEDIO(B3:C3), adaptándose a los datos del siguiente estudiante.","type":"content","url":"/bloque3#i-referencia-relativa-autom-tica","position":5},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Referencia Absoluta (Fija)","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"type":"lvl3","url":"/bloque3#ii-referencia-absoluta-fija","position":6},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Referencia Absoluta (Fija)","lvl2":"1. Referencias: ¿Qué Fijo y Qué Muevo?"},"content":"La Referencia Absoluta se usa cuando un valor específico nunca debe cambiar al copiar la fórmula.\n\nSintaxis: Se indica con el signo del dólar ($) antes de la letra de la columna y el número de la fila (ej: $H$1).\n\nUso Práctico: Se utiliza para mantener fijo un valor clave, como una tasa de impuestos o un bono fijo.\n\nEjemplo (Calificaciones): Si quieres calcular la nota Final sumando un valor Extra fijo (por ejemplo, 0,5) a la nota Media, y ese valor extra está en la celda H1, la fórmula debe ser =D2+$H$1. Al copiar esta fórmula, la referencia a $H$1 permanecerá fija, mientras que la referencia a D2 (la nota media) cambiará de forma relativa (D3, D4, etc.).\n\nEjemplo (IVA): Si calculas el IVA del Importe, donde el porcentaje de IVA (21,00%) está en la celda E1, la fórmula debe ser =D3*$E$1. El D3 (el importe) es relativo, pero el $E$1 (el porcentaje) es absoluto para que se aplique correctamente a todos los artículos.\n\n\n\nFigure 1:Referencias en Google Sheets.","type":"content","url":"/bloque3#ii-referencia-absoluta-fija","position":7},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"type":"lvl2","url":"/bloque3#id-2-l-gica-condicional-tomar-decisiones","position":8},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"content":"La lógica condicional permite que la hoja de cálculo realice una evaluación de un dato y tome una decisión automática sobre qué mostrar o qué acción realizar.","type":"content","url":"/bloque3#id-2-l-gica-condicional-tomar-decisiones","position":9},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. La Función SI (IF)","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"type":"lvl3","url":"/bloque3#i-la-funci-n-si-if","position":10},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. La Función SI (IF)","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"content":"La función SI es la herramienta fundamental para automatizar decisiones. Evalúa si una condición es verdadera o falsa y devuelve un resultado correspondiente.\n\nPropósito: Automatiza decisiones y clasifica datos.\n\nSintaxis: =SI(expresión_lógica, valor_si_verdadero, valor_si_falso).\n\nLa expresión_lógica es la condición que se evalúa (ej. B2 >= 50).\n*El valor_si_verdadero es el resultado si la condición es cierta (TRUE).\n\nEl valor_si_falso es el resultado si la condición es falsa (FALSE).\n\nImportante: Cuando se especifican textos como resultados (ej. “Aprobado”, “Suspenso”), deben ir entre comillas dobles.\n\nEjemplos de Aplicación:\n\nCalificaciones: Determinar si un alumno está “Aprobado” o “Suspenso” basándose en una nota (ej. si la nota es mayor o igual a 5).\n\nClima: Determinar si la presión atmosférica resulta en una “Borrasca” (presión menor o igual a 1000 mb) o un “Anticiclón” (presión mayor a 1000 mb).\n\nBonificaciones: Si las horas trabajadas son >30, se devuelve “Bonus”; si no, “No Bonus”.\n\nValidación de Datos: Puede usarse junto con funciones como ISTEXT para verificar si una celda contiene texto.","type":"content","url":"/bloque3#i-la-funci-n-si-if","position":11},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Operadores Lógicos Avanzados (AND / OR)","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"type":"lvl3","url":"/bloque3#ii-operadores-l-gicos-avanzados-and-or","position":12},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Operadores Lógicos Avanzados (AND / OR)","lvl2":"2. Lógica Condicional (Tomar Decisiones)"},"content":"Para condiciones más complejas, la función SI se combina con los operadores Y (AND) u O (OR).\n\nY (AND): Devuelve VERDADERO (TRUE) solo si todas las condiciones especificadas son ciertas.\n\nO (OR): Devuelve VERDADERO (TRUE) si al menos una de las condiciones es cierta.","type":"content","url":"/bloque3#ii-operadores-l-gicos-avanzados-and-or","position":13},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"3. Conteo Condicional y Formato Automático"},"type":"lvl2","url":"/bloque3#id-3-conteo-condicional-y-formato-autom-tico","position":14},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl2":"3. Conteo Condicional y Formato Automático"},"content":"Estas funciones te permiten resumir grandes conjuntos de datos de forma automática.","type":"content","url":"/bloque3#id-3-conteo-condicional-y-formato-autom-tico","position":15},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. Conteo Condicional (Función CONTAR.SI / COUNTIF)","lvl2":"3. Conteo Condicional y Formato Automático"},"type":"lvl3","url":"/bloque3#i-conteo-condicional-funci-n-contar-si-countif","position":16},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"I. Conteo Condicional (Función CONTAR.SI / COUNTIF)","lvl2":"3. Conteo Condicional y Formato Automático"},"content":"La función CONTAR.SI se utiliza para contar el número de celdas dentro de un rango que cumplen con un criterio específico.\n\nUso Práctico: Se utiliza para determinar, por ejemplo, el Nº de Alumnos Aprobados o el Nº de Alumnos Suspensos en una asignatura, basándose en los resultados de la Función SI.\n\nDiferencia con CONTAR: CONTAR() solo cuenta las celdas que contienen números, mientras que CONTAR.SI cuenta las celdas que cumplen una condición lógica (ej. contar solo las celdas que dicen “Aprobado” o que contienen un número mayor a 5).","type":"content","url":"/bloque3#i-conteo-condicional-funci-n-contar-si-countif","position":17},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Formato Condicional","lvl2":"3. Conteo Condicional y Formato Automático"},"type":"lvl3","url":"/bloque3#ii-formato-condicional","position":18},{"hierarchy":{"lvl1":"III. Lógica Condicional y Referencias Fijas","lvl3":"II. Formato Condicional","lvl2":"3. Conteo Condicional y Formato Automático"},"content":"El Formato Condicional aplica estilos visuales (como colores) a una celda automáticamente si el valor de esa celda cumple una condición lógica o regla predefinida.\n\nDiferencia del Formato Manual: En el Bloque I, aplicaste colores manualmente. El Formato Condicional es automático y dinámico: si el dato cambia, el color cambia con él.\n\nEjemplo: Se utiliza para mostrar las notas iguales o superiores a 5 en color verde, mientras que las inferiores a 5 se muestran en rojo. Esto permite una visualización inmediata del rendimiento sin necesidad de revisar cada número.","type":"content","url":"/bloque3#ii-formato-condicional","position":19},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos"},"type":"lvl1","url":"/bloque4","position":0},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos"},"content":"","type":"content","url":"/bloque4","position":1},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"1. Funciones de Búsqueda y Extracción de Datos"},"type":"lvl2","url":"/bloque4#id-1-funciones-de-b-squeda-y-extracci-n-de-datos","position":2},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"1. Funciones de Búsqueda y Extracción de Datos"},"content":"En ocasiones, necesitamos buscar un dato específico dentro de una gran tabla y traer un valor relacionado.","type":"content","url":"/bloque4#id-1-funciones-de-b-squeda-y-extracci-n-de-datos","position":3},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Función BUSCARV (VLOOKUP)","lvl2":"1. Funciones de Búsqueda y Extracción de Datos"},"type":"lvl3","url":"/bloque4#i-funci-n-buscarv-vlookup","position":4},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Función BUSCARV (VLOOKUP)","lvl2":"1. Funciones de Búsqueda y Extracción de Datos"},"content":"La función BUSCARV (o VLOOKUP) se utiliza para buscar un valor en la primera columna de un rango y devolver un valor de una columna diferente en esa misma fila. Esta función es fundamental para automatizar la extracción de datos de tablas grandes.\n\nAplicaciones basadas en Ejercicios:\n\nBúsqueda Geográfica: Después de calcular la Densidad (habitantes/km2) para varias Comunidades Autónomas, podemos configurar una celda para que, al ingresar el nombre de una Comunidad (ej. Madrid), la función BUSCARV devuelva automáticamente su densidad correspondiente (ej. 841,17).\n\nClasificación Climática: Se puede utilizar BUSCARV para buscar un Índice de Aridez (calculado a partir de datos de precipitaciones y temperatura, como en el caso de Pontevedra) y devolver el Tipo de clima asociado (ej. Húmedo) que se encuentra en una tabla de rangos predefinidos.\n\n\n\nFigure 1:Análisis de datos en Google Sheets.","type":"content","url":"/bloque4#i-funci-n-buscarv-vlookup","position":5},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"type":"lvl2","url":"/bloque4#id-2-an-lisis-asistido-por-ia-la-funci-n-explorar","position":6},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"content":"Google Sheets incluye una potente herramienta que utiliza aprendizaje automático (Machine Learning o IA) para ayudar a analizar datos sin necesidad de escribir fórmulas complejas. Esta herramienta se conoce como la función Explorar (Explore feature).","type":"content","url":"/bloque4#id-2-an-lisis-asistido-por-ia-la-funci-n-explorar","position":7},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Uso y Características","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"type":"lvl3","url":"/bloque4#i-uso-y-caracter-sticas","position":8},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Uso y Características","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"content":"Acceso Rápido: La función Explorar se encuentra en la esquina inferior derecha de la interfaz de Google Sheets, representada por un icono de una estrella de cuatro puntas con un brillo. También se puede acceder a ella mediante el menú superior (Herramientas > Explorar).\n\nAsistente Personal: Actúa como un analista de datos personal que genera gráficos, resume información y responde preguntas en lenguaje sencillo.\n\nAnálisis Automático: Al abrir el panel Explorar, la IA escanea los datos seleccionados y sugiere proactivamente gráficos relevantes, información clave, tablas dinámicas y soluciones de formato.","type":"content","url":"/bloque4#i-uso-y-caracter-sticas","position":9},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"II. Preguntas en Lenguaje Natural (NLQ)","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"type":"lvl3","url":"/bloque4#ii-preguntas-en-lenguaje-natural-nlq","position":10},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"II. Preguntas en Lenguaje Natural (NLQ)","lvl2":"2. Análisis Asistido por IA: La Función Explorar"},"content":"La característica más poderosa de Explorar es su motor de Preguntas en Lenguaje Natural.\n\nFormulación de Consultas: Se puede escribir una pregunta en lenguaje cotidiano (ej. “¿cuáles fueron las ventas totales por región?”) y Explorar procesará la consulta para ofrecer una respuesta instantánea, a menudo generando una visualización o un gráfico.\n\nGeneración de Gráficos Instantánea: El sistema selecciona automáticamente el tipo de gráfico adecuado (barras, líneas, circular, etc.) para representar la respuesta a la pregunta formulada.\n\nFormato Fácil: Explorar puede aplicar formatos profesionales, como colores alternos a las filas de la tabla, con un solo clic.\n\nRequisito de Datos: Para que Explorar funcione correctamente, es crucial que los datos estén limpios y organizados, con encabezados claros y sin celdas combinadas.","type":"content","url":"/bloque4#ii-preguntas-en-lenguaje-natural-nlq","position":11},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"3. Tablas Dinámicas (Pivot Tables)"},"type":"lvl2","url":"/bloque4#id-3-tablas-din-micas-pivot-tables","position":12},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"3. Tablas Dinámicas (Pivot Tables)"},"content":"Las Tablas Dinámicas son herramientas flexibles y potentes para resumir grandes conjuntos de datos de forma dinámica.\n\nPropósito: Permiten analizar la misma información desde múltiples perspectivas sin necesidad de crear una hoja de cálculo nueva para cada análisis.\n\nCreación: Se insertan seleccionando los datos de origen y yendo a Insertar > Tabla dinámica.\n\nEditor: El editor de Tablas Dinámicas permite arrastrar campos a diferentes áreas: Filas, Columnas, Valores (la métrica que se va a agregar, como SUMA o PROMEDIO) y Filtros.\n\nVentajas: Permiten crear informes de resumen complejos en segundos y la hoja de cálculo se encarga de todo el trabajo de agregación automáticamente. Los datos en la tabla dinámica se actualizan si los datos de origen cambian.\n\nLa visualización de datos es una fase crítica del análisis que transforma las tablas numéricas en información clara y comprensible. A continuación, se amplía el punto de Visualización de Datos (Gráficos), detallando su creación, tipos y la ayuda de la inteligencia artificial:","type":"content","url":"/bloque4#id-3-tablas-din-micas-pivot-tables","position":13},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"4. Visualización de Datos (Gráficos)"},"type":"lvl2","url":"/bloque4#id-4-visualizaci-n-de-datos-gr-ficos","position":14},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl2":"4. Visualización de Datos (Gráficos)"},"content":"Los gráficos son herramientas esenciales para comprender tendencias y patrones en los datos de un vistazo. Permiten a los usuarios transformar grandes cantidades de números en visualizaciones sencillas y potentes.","type":"content","url":"/bloque4#id-4-visualizaci-n-de-datos-gr-ficos","position":15},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Creación e Inserción","lvl2":"4. Visualización de Datos (Gráficos)"},"type":"lvl3","url":"/bloque4#i-creaci-n-e-inserci-n","position":16},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"I. Creación e Inserción","lvl2":"4. Visualización de Datos (Gráficos)"},"content":"El proceso básico para generar un gráfico a partir de una tabla de datos es directo:\n\nSelección de Datos: Para crear un gráfico, se deben seleccionar todos los datos de origen que se desean visualizar. Es importante incluir los encabezados de columna en la selección.\n\nInserción Manual: El gráfico se inserta haciendo clic en Insertar > Gráfico.\n\nResultado Inicial: Por defecto, Google Sheets a menudo convierte los datos en un gráfico de barras. Además, la herramienta Explorar (Explore feature) puede escanear los datos y generar instantáneamente gráficos o resúmenes estadísticos que se pueden insertar directamente en la hoja con un solo clic.","type":"content","url":"/bloque4#i-creaci-n-e-inserci-n","position":17},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"II. Tipos de Gráficos y sus Aplicaciones","lvl2":"4. Visualización de Datos (Gráficos)"},"type":"lvl3","url":"/bloque4#ii-tipos-de-gr-ficos-y-sus-aplicaciones","position":18},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"II. Tipos de Gráficos y sus Aplicaciones","lvl2":"4. Visualización de Datos (Gráficos)"},"content":"Google Sheets soporta una variedad de tipos de gráficos, cada uno adecuado para diferentes tipos de análisis:\n\nTipo de Gráfico\n\nPropósito y Uso (Basado en las Fuentes)\n\nCitas de Origen\n\nGráficos de Barras / Columnas\n\nSe utilizan comúnmente para comparar valores entre categorías o mostrar tendencias. La herramienta Explorar a menudo sugiere gráficos de barras. Se pueden usar para mostrar el Número de Trabajadores de diferentes empresas a lo largo de varios años.\n\n\n\nGráficos Circulares (Tarta)\n\nMuestran la contribución proporcional de cada parte al todo. Se utilizan, por ejemplo, para visualizar el número de alumnos aprobados y suspensos en una asignatura.\n\n\n\nGráficos Radiales\n\nSon útiles para comparar las estadísticas o habilidades de dos sujetos distintos en múltiples categorías. Por ejemplo, se usan para comparar habilidades como Pases, Regates, Centros, o Remates de cabeza entre dos sujetos (ej. Messi y Ronaldo).\n\n\n\nOtros Tipos\n\nTambién existen gráficos de líneas (ideales para mostrar tendencias temporales, como “ventas totales a lo largo del tiempo”) y diagramas de dispersión (scatter plots).\n\n","type":"content","url":"/bloque4#ii-tipos-de-gr-ficos-y-sus-aplicaciones","position":19},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"III. Edición y Personalización","lvl2":"4. Visualización de Datos (Gráficos)"},"type":"lvl3","url":"/bloque4#iii-edici-n-y-personalizaci-n","position":20},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"III. Edición y Personalización","lvl2":"4. Visualización de Datos (Gráficos)"},"content":"Una vez que el gráfico está en la hoja, los usuarios tienen control total para modificar su apariencia y contenido:\n\nEditor de Gráficos: El gráfico se puede editar utilizando el Editor de Gráficos (Chart editor).\n\nAjustes: El editor permite ajustar colores, títulos o etiquetas de los ejes. Esto es importante para hacer que la visualización final sea clara y profesional.\n\nCambio de Tamaño y Posición: El gráfico puede ser redimensionado haciendo clic y arrastrando los puntos que rodean su borde, y puede ser recolocado arrastrándolo a la posición deseada en la hoja.","type":"content","url":"/bloque4#iii-edici-n-y-personalizaci-n","position":21},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"IV. Visualización Asistida por IA (Función Explorar)","lvl2":"4. Visualización de Datos (Gráficos)"},"type":"lvl3","url":"/bloque4#iv-visualizaci-n-asistida-por-ia-funci-n-explorar","position":22},{"hierarchy":{"lvl1":"IV. Análisis Avanzado y Visualización de Datos","lvl3":"IV. Visualización Asistida por IA (Función Explorar)","lvl2":"4. Visualización de Datos (Gráficos)"},"content":"La función Explorar (Explore feature) utiliza el aprendizaje automático (Machine Learning) para generar gráficos y visualizar datos.\n\nSugerencias Automáticas: La IA escanea los datos y sugiere proactivamente gráficos relevantes (como gráficos de barras o circulares).\n\nConsultas en Lenguaje Natural (NLQ): Los usuarios pueden hacer preguntas específicas sobre los datos en lenguaje cotidiano (ej. “¿cuáles fueron las ventas totales por región?”) y el sistema genera la visualización adecuada de forma instantánea. El sistema selecciona automáticamente el tipo de gráfico que mejor responde a la pregunta.\n\nPersonalización: Los gráficos generados por la función Explorar son objetos estándar de Google Sheets y se pueden seguir personalizando con el Editor de Gráficos.\n\nRequisito de Datos para Gráficos y Explorar:\nPara que la visualización sea efectiva y la función Explorar trabaje correctamente, los datos deben estar limpios y organizados. Es fundamental utilizar encabezados claros y evitar las celdas combinadas (merged cells), ya que confunden a la IA sobre la estructura real de la tabla.","type":"content","url":"/bloque4#iv-visualizaci-n-asistida-por-ia-funci-n-explorar","position":23},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización"},"type":"lvl1","url":"/bloque5","position":0},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización"},"content":"Este bloque explica cómo Google Sheets funciona en la nube, permitiendo el trabajo en equipo, la protección de datos y la conexión con miles de otras aplicaciones.","type":"content","url":"/bloque5","position":1},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"1. Google Sheets como Plataforma Colaborativa"},"type":"lvl2","url":"/bloque5#id-1-google-sheets-como-plataforma-colaborativa","position":2},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"1. Google Sheets como Plataforma Colaborativa"},"content":"Google Sheets es una aplicación de hoja de cálculo gratuita y basada en la web que forma parte del servicio Google Drive. A diferencia del software tradicional de escritorio, Sheets fue diseñado pensando en la colaboración.","type":"content","url":"/bloque5#id-1-google-sheets-como-plataforma-colaborativa","position":3},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Edición en Tiempo Real","lvl2":"1. Google Sheets como Plataforma Colaborativa"},"type":"lvl3","url":"/bloque5#i-edici-n-en-tiempo-real","position":4},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Edición en Tiempo Real","lvl2":"1. Google Sheets como Plataforma Colaborativa"},"content":"Colaboración en Vivo: La característica clave es la edición simultánea. Múltiples usuarios pueden abrir, editar y dar formato al mismo documento al mismo tiempo.\n\nGuardado Automático: Todos los cambios realizados se guardan automáticamente en los servidores de Google.\n\nHistorial de Revisión: La función de Historial de Revisión (Revision History) rastrea todas las modificaciones. Esto permite a los editores revisar ediciones anteriores y revertir cualquier cambio no deseado o no autorizado.\n\nComunicación Integrada: Incluye una función de chat en la barra lateral que permite a los colaboradores discutir las ediciones y hacer recomendaciones en tiempo real sin tener que usar correos electrónicos externos.","type":"content","url":"/bloque5#i-edici-n-en-tiempo-real","position":5},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"2. Gestión de Seguridad y Permisos"},"type":"lvl2","url":"/bloque5#id-2-gesti-n-de-seguridad-y-permisos","position":6},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"2. Gestión de Seguridad y Permisos"},"content":"Para trabajar con datos sensibles o en equipo, es esencial controlar quién puede acceder y modificar el archivo.","type":"content","url":"/bloque5#id-2-gesti-n-de-seguridad-y-permisos","position":7},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Roles de Acceso (Permisos)","lvl2":"2. Gestión de Seguridad y Permisos"},"type":"lvl3","url":"/bloque5#i-roles-de-acceso-permisos","position":8},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Roles de Acceso (Permisos)","lvl2":"2. Gestión de Seguridad y Permisos"},"content":"Al compartir un documento, se debe asignar un nivel de permiso a cada usuario para controlar quién puede ver, editar o comentar.\n\nRol de Permiso\n\nCapacidad de Interacción\n\nCitas de Origen\n\nLector (Viewer)\n\nSolo puede ver el contenido del documento.\n\n\n\nComentarista (Commenter)\n\nPuede ver el contenido y dejar comentarios, pero no puede editar los datos.\n\n\n\nEditor\n\nPuede realizar cambios en el documento, incluyendo editar los datos. Si se le permite, también puede cambiar la configuración de uso compartido.\n\n\n\nWriter (Escritor, Rol avanzado)\n\nPuede añadir, editar o borrar datos dentro de las filas. No puede modificar la estructura de la hoja (como las columnas o las fórmulas críticas).\n\n","type":"content","url":"/bloque5#i-roles-de-acceso-permisos","position":9},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"II. Protección Avanzada","lvl2":"2. Gestión de Seguridad y Permisos"},"type":"lvl3","url":"/bloque5#ii-protecci-n-avanzada","position":10},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"II. Protección Avanzada","lvl2":"2. Gestión de Seguridad y Permisos"},"content":"Google Sheets ofrece funciones avanzadas de seguridad para proteger partes específicas del documento.\n\nProtección de Pestañas y Rangos: Se pueden proteger pestañas (sheets) completas o rangos de celdas específicos para evitar que los usuarios, incluso los Editores, puedan modificarlos. Esto permite a los usuarios ver los datos, pero restringe la edición.\n\nRestricción de Permisos: Se puede configurar el archivo para evitar que los Editores cambien los permisos de acceso o añadan nuevas personas.\n\nFechas de Caducidad: Se pueden establecer fechas de caducidad para el acceso, lo cual es útil para dar acceso temporal a colaboradores externos (disponible en cuentas de Google Workspace).","type":"content","url":"/bloque5#ii-protecci-n-avanzada","position":11},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"type":"lvl2","url":"/bloque5#id-3-integraci-n-y-automatizaci-n-apps-script-y-zapier","position":12},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"content":"Sheets es un nodo central en el ecosistema digital, capaz de conectarse con miles de otras aplicaciones y automatizar tareas.","type":"content","url":"/bloque5#id-3-integraci-n-y-automatizaci-n-apps-script-y-zapier","position":13},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Automatización con Apps Script (Low-Code)","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"type":"lvl3","url":"/bloque5#i-automatizaci-n-con-apps-script-low-code","position":14},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"I. Automatización con Apps Script (Low-Code)","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"content":"Google Apps Script (GAS) es un entorno de programación de bajo código basado en JavaScript que permite a los usuarios automatizar y mejorar Google Sheets.\n\nFunciones Personalizadas y Macros: Permite crear funciones personalizadas o macros adaptadas a las necesidades específicas.\n\nIntegración con Google Cloud: Apps Script se utiliza para conectar Sheets con otros servicios de Google Workspace. Un ejemplo avanzado es usar Apps Script para activar un “Workflow” (flujo de trabajo) en Google Cloud, como la creación de una máquina virtual (VM), cuando se marca una casilla de verificación en una celda de Sheets.\n\nCreación de Documentos y Comunicación: Apps Script puede automatizar tareas complejas, como crear un documento de Google Docs y enviar un correo electrónico al usuario con el enlace a ese nuevo documento.","type":"content","url":"/bloque5#i-automatizaci-n-con-apps-script-low-code","position":15},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"II. Conexión con Aplicaciones Externas (Zapier)","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"type":"lvl3","url":"/bloque5#ii-conexi-n-con-aplicaciones-externas-zapier","position":16},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"II. Conexión con Aplicaciones Externas (Zapier)","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"content":"Plataformas como Zapier actúan como un puente que conecta Google Sheets con más de 8,000 aplicaciones de terceros. Esto permite crear flujos de trabajo automatizados (Zaps).\n\nTarea Automatizada (Ejemplos)\n\nAplicaciones Integradas\n\nCitas de Origen\n\nRecopilación de Datos\n\nAñadir nuevos leads de Google Ads o Facebook Lead Ads como filas en Sheets.\n\n\n\nNotificaciones\n\nEnviar mensajes a Slack o correos electrónicos vía Gmail cuando se actualizan filas en Sheets.\n\n\n\nRegistro de Transacciones\n\nRegistrar nuevas ventas de Stripe o citas de Acuity Scheduling como nuevas filas en Sheets.\n\n","type":"content","url":"/bloque5#ii-conexi-n-con-aplicaciones-externas-zapier","position":17},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"III. Compatibilidad de Archivos","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"type":"lvl3","url":"/bloque5#iii-compatibilidad-de-archivos","position":18},{"hierarchy":{"lvl1":"V. Colaboración, Seguridad y Automatización","lvl3":"III. Compatibilidad de Archivos","lvl2":"3. Integración y Automatización (Apps Script y Zapier)"},"content":"Google Sheets garantiza la compatibilidad con formatos tradicionales, facilitando el intercambio de datos.\n\nImportación: Soporta la apertura y edición de archivos de Microsoft Excel (como .xlsx, .xls), .csv, .ods, y .tsv.\n\nExportación: Permite la exportación de datos a formatos estándar como .xlsx y .pdf.\n\nRecuerda:\nLa Colaboración se basa en tener una única fuente de verdad (el archivo en Drive), mientras que la Seguridad se gestiona limitando los permisos (Lector, Comentarista, Editor) y protegiendo las celdas clave. La Automatización permite a Sheets convertirse en una parte activa de los procesos al conectarse a otras aplicaciones mediante Apps Script o herramientas como Zapier.","type":"content","url":"/bloque5#iii-compatibilidad-de-archivos","position":19},{"hierarchy":{"lvl1":"Introducción"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Introducción"},"content":"Imagina una hoja de cálculo como un supercuaderno digital diseñado específicamente para organizar, analizar y calcular datos de forma eficiente. En lugar de escribir números y hacer cálculos a mano con una calculadora, la hoja de cálculo lo hace por ti al instante.\n\nAnalogía: Piensa en la lista de jugadores y estadísticas de tu equipo de fútbol o baloncesto favorito. Cada jugador es una fila, y sus datos (goles, asistencias, minutos jugados) son las columnas. ¡Una hoja de cálculo es perfecta para eso!\n\n\n\nFigure 1:El poder de las hojas de cálculo.\n\n¿Por qué es importante? Saber usar Google Sheets te da una superhabilidad en el mundo real. Las empresas, los científicos y hasta tú mismo para gestionar tus gastos o planificar un viaje, usan hojas de cálculo para tomar decisiones basadas en datos. ¡Es la base de la organización moderna!\n\nCuriosidad: ¿Sabías que las primeras hojas de cálculo electrónicas se inventaron para simplificar los tediosos cálculos financieros? ¡Ahora se usan para casi cualquier cosa, desde hacer gráficos de tus notas hasta simular la trayectoria de un cohete! 🚀\n\nAhora que tienes una idea general, me gustaría saber qué has captado:\n\nActividad de Aprendizaje (Cuestionario rápido):\n\nSi tuvieras que explicarle a un compañero de clase para qué sirve Google Sheets, ¿cuál de estas opciones escogerías?\n\nA) Principalmente para escribir cartas y hacer redacciones largas.B) Para crear presentaciones visuales y diapositivas bonitas.C) Para organizar información en tablas y hacer cálculos automáticos.\n\n¡Dime cuál crees que es la respuesta correcta! 🧐","type":"content","url":"/","position":1}]}